# Как клонировать репозиторий
1. Откройте репозиторий в GitHub.
2. Нажмите **Code**.
3. Убедитесь, что настроен SSH-ключ.
4. Выберите **Local Clone SSH**.
5. Нажмите **Copy**.
6. Откройте консоль.
7. Перейдите в папку, в которую надо положить репозиторий.
8. Выполните команду `git clone <https://github.com/адрес-репозитория/который-надо-скопировать>`, чтобы создать копию удалённого репозитория на вашем компьютере.
9. Убедитесь в том, что репозитории связаны, командой `git remote -v`.

Основное:
* Команда `git clone` копирует проект на локальный компьютер.
* `git clone` автоматически связывает локальный репозиторий с удалённым.

# Что такое Fork
**Fork** (англ. «развилка», «ответвление»), или «форк», — это GitHub-операция; напрямую с Git она не связана. «Форк» создаёт копию репозитория в аккаунте GitHub. Такая копия будет полностью независима. Изменения, которые вы внесёте, не будут синхронизированы с исходным репозиторием.

В процессе «форка» создаётся копия всех файлов, истории коммитов и веток. Эта копия сохраняется в вашей учётной записи GitHub.

## Как выполнить Fork
1. Откройте репозиторий в GitHub.
2. Нажмите **Fork** в правом верхнем углу.
3. При необходимости поменяйте название и описание репозитория.
4. Нажмите **Create fork**.
5. Подождите, пока репощиторий скопируется.

После этого он будет доступен по адресу `https://github.com/%USERNAME%/git-basics`, где `%USERNAME%` — ваше имя пользователя.

## «Форк» или clone?
 Обычно комбинация «форк» + `clone` используется для внесения изменений в публичные репозитории. В этом случае «форк» становится подготовительным этапом перед клонированием чужого репозитория на ваш компьютер.
 
 Если репозиторий приватный или это репозиторий вашей компании, при работе с ним достаточно `clone`.

 Важное:

 * «Форк» создаёт копию существующего репозитория в аккаунте на GitHub.
 * «Форк» позволяет вносить изменения в репозиторий независимо от оригинального проекта.